tap "homebrew/services"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Safe, concurrent, practical language
brew "rust"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Web browser focusing on privacy
cask "brave-browser"
# Text editor
cask "emacs-app"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool for designing and simulating digital logic circuits
cask "logisim"
# Create, manage, and run virtual machines
cask "vmware-fusion"
vscode "docker.docker"
vscode "formulahendry.code-runner"
vscode "github.vscode-github-actions"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "rust-lang.rust-analyzer"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
cargo "cargo-modules"
cargo "evcxr_repl"
